//======================================================================================================================================
// ヘッダコメント										他のファイルに使ってほしいもの

//======================
// バレット
//======================

// 作成者	ryoya nagata
// 作成日	2017/07/10(月)
// 変更点	

//======================================================================================================================================

#ifndef _DEBUG_H_
#define _DEBUG_H_

void InitDebugString(void);
void UninitDebugString(void);
void DebugPolygon(int n, float x, float y, float r);
void DebugString(int x, int y, const char* pFormat, ...);		// char 表示したい文字列  printfは引数が永遠	よって...は複数の意味を持つ

#endif