//******************************************************************
//
//							[Main.h]											
//			Author：	作成日：2017/06/05			
//******************************************************************
#ifndef _MAIN_H
#define _MAIN_H

//*************************************************************************************************************************
// インクルード
//*************************************************************************************************************************
#include <Windows.h>
#include <stdio.h>
#include <d3d9.h>
#include <d3dx9.h>

//*************************************************************************************************************************
// マクロ定義
//*************************************************************************************************************************
#define CLASS_NAME	"sample"					// クラスの名前
#define WINDOW_NAME "ウィンドウ"				// ウィンドウの名前
#define SCREEN_WIDTH	(800)					// ウィンドウの幅
#define SCREEN_HEIGHT	(600)					// ウィンドウの高さ

//*************************************************************************************************************************
// プロトタイプ宣言
//*************************************************************************************************************************
LRESULT CALLBACK WndProc(HWND hWnd, UINT uMsg, WPARAM wParam, LPARAM lParam);	// ウィンドウプロシージャ
bool Init(HINSTANCE hInstance, HWND hWnd, BOOL bWindow);
void Uninit(void);
void Update(void);
void Draw(void);


#ifdef _DEBUG
void DrawFPS(void);
#endif

// Direct3DDeviceの取得
LPDIRECT3DDEVICE9 GetD3DDevice(void);

#endif	// _MAIN_H