#ifndef _POLYGON_3D_TEST_
#define _POLYGON_3D_TEST_


//*************************************************************************************************************************
// マクロ定義
//*************************************************************************************************************************

#define ARRAYCOUNT(x) sizeof(x) / sizeof(x[0])
#define FVF_VERTEX_3D (D3DFVF_XYZ | D3DFVF_DIFFUSE |D3DFVF_TEX1|D3DFVF_NORMAL)	// RHWは変換フラグなので抜く

//*************************************************************************************************************************
// 構造体
//*************************************************************************************************************************

typedef struct
{// 頂点の構造体
	D3DXVECTOR3 pos;		// 座標
	D3DXVECTOR3 normal;		//法線
	D3DCOLOR color;			// 色
	D3DXVECTOR3 texcoord;	// テクスチャ座標
}VERTEX_3D;

typedef struct
{
	char fileName[256];
	int width;
	int height;
}TEXTURE2;

//*************************************************************************************************************************
// 宣言
//*************************************************************************************************************************

bool Polygon3DTestInit(HWND hWnd);
void Polygon3DTestUninit(void);
void Polygon3DTestUpdate(void);
void Polygon3DTestDraw(void);
void CreateVertex(void);

#endif